#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=247cc2ff69516b35c8acc679292eca44f7c3f0c7]
data.aws_cloudwatch_log_group.log_group: Reading...
data.aws_caller_identity.current: Reading...
aws_iam_role.lambda: Refreshing state... [id=error-parsing-prod-eu-west-3-lambdaRole]
aws_sns_topic.alarm_topic: Refreshing state... [id=arn:aws:sns:eu-west-3:505394176116:error-parsing-alerts-alarm]
data.aws_caller_identity.current: Read complete after 0s [id=505394176116]
aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=error-parsing-prod-eu-west-3-lambdaRole:error-parsing-cloudwatch-logs]
data.aws_cloudwatch_log_group.log_group: Read complete after 1s [id=/aws/lambda/publish-power-consumption-to-ha-prod-run]
aws_iam_role_policy.sns: Refreshing state... [id=error-parsing-prod-eu-west-3-lambdaRole:error-parsing-sns]
aws_sns_topic_subscription.email_subscription: Refreshing state... [id=arn:aws:sns:eu-west-3:505394176116:error-parsing-alerts-alarm:ec429d0d-d2f1-4cf6-a4ff-53ad1b0cffb9]
aws_lambda_function.error_parsing: Refreshing state... [id=error-parsing-prod-publish]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.log_filter will be created
  + resource "aws_cloudwatch_log_subscription_filter" "log_filter" {
      + destination_arn = "arn:aws:lambda:eu-west-3:505394176116:function:error-parsing-prod-publish"
      + distribution    = "ByLogStream"
      + filter_pattern  = "[ERROR]"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/publish-power-consumption-to-ha-prod-run"
      + name            = "error-filter"
      + role_arn        = (known after apply)
    }

  # aws_lambda_permission.cloudwatch_logs will be created
  + resource "aws_lambda_permission" "cloudwatch_logs" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "error-parsing-prod-publish"
      + id                  = (known after apply)
      + principal           = "logs.amazonaws.com"
      + source_arn          = "arn:aws:logs:eu-west-3:505394176116:log-group:/aws/lambda/publish-power-consumption-to-ha-prod-run"
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: ./terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "./terraform.plan"

```

</details>

*Pushed by: @aribasadme, Action: `pull_request`*